{
  "basic_info": {
    "description_header": "Hi",
    "description": "I am Shiva Kalyan Sunder Diwakaruni, a Graduate Research Assistant at Virtual Prototyping of Autonomy-Enabled Ground Systems (VIPR-GS) Lab, pursuing a Master's in Computer Science at Clemson University. I am currently looking for Software Development Engineer opportunities, where I can apply my four years of industrial experience and expertise to innovative projects and further advance my skills.",
    "section_name": {
      "about": "About me",
      "projects": "Projects", 
      "skills": "Skills",
      "experience": "Experience"
    }
  },
  "projects": [
    {
      "title": "Network Traffic Analysis of Third-Party Android Applications: Leveraging ChatGPT for Insights",
      "startDate": "2023",
      "description": "This project revolves around conducting data analysis of various third-party applications by intercepting and scrutinizing their network traffic. Using an emulator setup, we targeted applications sourced from apkmirror, aiming to uncover the nature of data collection within these apps. The progression of work spans multiple phases, encompassing environment configuration, data gathering, process automation, and leveraging mitmproxy for traffic analysis. Wireless debugging facilitated device-host pairing, allowing the execution of adb commands for both pairing and monkey fuzzing. Diverse categories of third-party Android apps, such as shopping and entertainment, were selectively collected as APKs for analysis. Automation played a pivotal role, achieved through a Python script orchestrating the seamless installation of apps on the emulator. This automation encompassed the initiation of mitmproxy, app launch, pinning the app to the screen, fuzzing, subsequent unpinning, and closure of the app. Captured mitmproxy flow data underwent pre-processing to organize requests and responses into a text-based format, streamlining the subsequent analysis. The project’s comprehensive approach towards app analysis through network traffic interception and automation paves the way for discerning insights into the data collection practices across a spectrum of third-party Android applications.",
      "images": [
        "images/portfolio/SAT/Badwoo.jpeg",
        "images/portfolio/SAT/Kohls.jpeg",
        "images/portfolio/SAT/Last.jpeg",
        "images/portfolio/SAT/Pintrest.jpeg",
        "images/portfolio/SAT/ShopListing.jpeg"
      ],
      "url": "https://github.com/kalyan1998/Network-Traffic-Analysis-of-Third-Party-Android-Applications",
      "technologies": [
        {
          "class": "devicon-python-plain",
          "name": "python"
        },
        {
          "class": "devicon-androidstudio-plain",
          "name": "Android Studio"
        }
      ]
    },
    {
      "title": "XY Performance Improvement",
      "startDate": "2023",
      "description": "This project focused on optimizing backend performance for visualizing XY data, resulting in a significant 50% increase in real-time data processing speed for datasets with over 1 million points. By implementing data thinning techniques and utilizing a scalable C++ concurrent queue service, we achieved a notable reduction in latency by approximately 30 seconds for large data transfers between the frontend and backend, while efficiently handling high-volume message queues. On the frontend, users can visualize data in a scatter plot, with options to display markers, lines, or both, enhancing interactivity and responsiveness. The improvements are demonstrated by the smooth cursor operations and quick data plotting in large datasets, showcasing a substantial enhancement in system performance and user experience.",
      "images": [
        "images/portfolio/XYImp/Before.jpeg",
        "images/portfolio/XYImp/XYImp.png"
      ],
      "url": "",
      "technologies": [
        {
          "class": "devicon-cplusplus-plain",
          "name": "C++"
        },
        {
          "class": "devicon-javascript-plain",
          "name": "JavaScript"
        },
        {
          "class": "devicon-matlab-plain",
          "name": "MATLAB"
        }
      ]
    },
    {
      "title": "XY Limits",
      "startDate": "2022",
      "description": "This project enhanced XY visualizations with a User-Defined Zooming feature supporting over 50 concurrent instances per session and a stateful design with publisher-subscriber services, reducing frontend redraws by 60% and backend data load by 20%. The 'Limits' section in the settings panel was revamped for direct canvas limit adjustments, streamlining user navigation. Data persistence across multiple visualizations was ensured by database storage, maintaining functionality upon reopening or reloading the Simulink Data Inspector.",
      "images": [
        "images/portfolio/limits/Before.jpg",
        "images/portfolio/limits/After.jpg",
        "images/portfolio/limits/Limits.mp4"
      ],
      "url": "",
      "technologies": [
        {
          "class": "devicon-cplusplus-plain",
          "name": "C++"
        },
        {
          "class": "devicon-javascript-plain",
          "name": "JavaScript"
        },
        {
          "class": "devicon-matlab-plain",
          "name": "MATLAB"
        }
      ]
    },
    {
      "title": "MAVIC: MATLAB Navigation Bot for Large Office Workspaces",
      "startDate": "2022",
      "description": "As part of the Hack Day 2022 event within MathWorks, I developed a Microsoft Teams bot using MATLAB, Typescript, and Azure. This bot harnessed the power of the A* algorithm and was adapted in this project to assist users in navigating within extensive office spaces or work environments. A logical 2D matrix representing the MathWorks office map was provided as input to the algorithm, where 'TRUE' denoted a visitable map cell and 'FALSE' indicated an impassable cell. The algorithm excelled in finding the shortest and most efficient paths throughout the map. Users could query the bot by providing source and destination points, and in response, the bot generated an image highlighting the map with clear directions, simplifying navigation within the office environment.",
      "images": [
        "images/portfolio/MAVIC/MAVIC.png"
      ],
      "url": "",
      "technologies": [
        {
          "class": "devicon-matlab-plain",
          "name": "MATLAB"
        },
        {
          "class": "devicon-typescript-plain",
          "name": "TypeScript"
        },
        {
          "class": "devicon-azure-plain",
          "name": "Azure"
        }
      ]
    },
    {
      "title": "Map Legend",
      "startDate": "2021",
      "description": "In my initial project as a member of the Simulink Data Inspector team, I introduced a vital feature to the map visualization component. Prior to this addition, there was no clear indicator to distinguish which signals were being plotted on the map visualization in SDI. The legend functionality I implemented was carefully designed to address this need. It not only provided a visual legend for better signal identification but also ensured that any changes in signal names from the associated table would dynamically update both the legend name and its corresponding tooltip, creating a seamless and informative user experience.",
      "images": [
        "images/portfolio/legend/legend.jpeg",
        "images/portfolio/legend/legend.mp4"
      ],
      "url": "",
      "technologies": [
        {
          "class": "devicon-cplusplus-plain",
          "name": "C++"
        },
        {
          "class": "devicon-javascript-plain",
          "name": "JavaScript"
        },
        {
          "class": "devicon-matlab-plain",
          "name": "MATLAB"
        }
      ]
    },
    {
      "title": "Map Markers",
      "startDate": "2021",
      "description": "In this frontend project, I harnessed the capabilities of mapboxgl APIs to enhance the marker differentiation process. Specifically, I modified the marker types to clearly distinguish between source, destination, and cursor markers. Furthermore, each marker was enriched with a dynamic popup feature, showcasing real-time updates of latitude and longitude positions as the cursor moved. For better understanding I included a comparison of images, highlighting the differences before and after these improvements were implemented.",
      "images": [
        "images/portfolio/Markers/Before.jpg",
        "images/portfolio/Markers/After.jpg",
        "images/portfolio/Markers/SourcePopup.jpg"
      ],
      "url": "",
      "technologies": [
        {
          "class": "devicon-cplusplus-plain",
          "name": "C++"
        },
        {
          "class": "devicon-javascript-plain",
          "name": "JavaScript"
        },
        {
          "class": "devicon-matlab-plain",
          "name": "MATLAB"
        }
      ]
    },
    {
      "title": "Driving Scenario",
      "startDate": "2020",
      "description": "During my internship at MathWorks, I worked on a project aimed at improving traffic light management and junction detection in road network simulations. I architected APIs with an optimized latency of approximately 10ms to render traffic lights from Open Street Maps (OSM) and HERE HD, enabling accurate mapping of traffic light positions to lanes within junctions. I represented the traffic network as a graph and scaled the design to support automatic scenario generation and simulation. Additionally, I created a MATLAB simulation replicating traffic light functionality, which resulted in a 40% improvement in junction detection accuracy. Throughout the project, I facilitated and presented knowledge-sharing meetings focused on advanced technologies such as Deep Learning (DL) and Advanced Driver-Assistance Systems (ADAS), contributing to the team's overall understanding and capabilities in these areas.",
      "images": [
        "images/portfolio/driving/roadnetwork.png"
      ],
      "url": "https://www.mathworks.com/help/driving/ref/drivingscenario.roadnetwork.html#responsive_offcanvas",
      "technologies": [
        {
          "class": "devicon-cplusplus-plain",
          "name": "C++"
        },
        {
          "class": "devicon-javascript-plain",
          "name": "JavaScript"
        },
        {
          "class": "devicon-matlab-plain",
          "name": "MATLAB"
        }
      ]
    },
    {
      "title": "Speech Emotion Recognition Using Multimodal Biometrics",
      "startDate": "2020",
      "description": "I served as a Technical Assistant, contributing to research in Speech Emotion Recognition (SER). Our research delved deep into this field, employing advanced techniques like Mel spectrograms and data augmentation, including time-shifting and time-frequency masking using Python. Our findings were published in a research paper, demonstrating that the use of Mel spectrograms substantially improved the average model accuracy, reaching an impressive 75%.",
      "images": [
        "images/portfolio/SER/mel.png"
      ],
      "url": "https://app.box.com/s/8600smczowa0f71fauroe6r4sztpel8r",
      "technologies": [
        {
          "class": "devicon-python-plain",
          "name": "python"
        }
      ]
    },
    {
      "title": "Facial Recognition After Plastic Surgery",
      "startDate": "2019",
      "description": "During my undergraduation, I addressed the challenge of facial recognition post-plastic surgery. I developed a Bag of Features model in MATLAB, strategically selecting point locations using dense SURF (Speeded-Up Robust Features) extraction to enhance accuracy. Additionally, I commenced my research experience by thoroughly reviewing relevant research papers to gain insights into various models. I conducted multiple trials with Bag of Features models and presented my findings to my advisor, highlighting the superior accuracy achieved with dense SURF feature extraction. This project marked the beginning of my research journey.",
      "images": [
        "images/portfolio/FaceRecognition/facialRecognition.png"
      ],
      "url": "https://github.com/kalyan1998/Face-Recognition",
      "technologies": [
        {
          "class": "devicon-matlab-plain",
          "name": "MATLAB"
        }
      ]
    },
    {
      "title": "Earthquake Alert System",
      "startDate": "2018",
      "description": "As part of the NASA Space Apps Hackathon, We harnessed the potential of Android technology, employing Android Studio along with USGS API end points and the Google Maps API to create an application that not only informs and guides users during an approaching earthquake but also offers alerts, notifications, and a preparedness checklist for their safety. secured the first-place position at the college level of the competition. Due to this success, we advanced to the next round of the hackathon.",
      "images": [
        "images/portfolio/Earthquake/earthquakeAlertSystem.png"
      ],
      "url": "https://github.com/kalyan1998/nasa_spaceapps",
      "technologies": [
        {
          "class": "devicon-androidstudio-plain",
          "name": "Android Studio"
        },
        {
          "class": "devicon-javascript-plain",
          "name": "JavaScript"
        },
        {
          "class": "devicon-php-plain",
          "name": "PHP"
        },
        {
          "class": "devicon-html5-plain",
          "name": "HTML5"
        },
        {
          "class": "devicon-css3-plain",
          "name": "CSS3"
        }
      ]
    }
  ],
    "experience": [
      {
        "company": "Clemon University, VIPR-GS Lab",
        "title": "Graduate Research Assistant",
        "years": "1.2024 - Present",
        "mainTech": [
          "Python"
        ],
        "technologies": [
          "Python",
          "GO",
          "MATLAB"
        ],
        "description": []
      },
      {
        "company": "MathWorks",
        "title": "Senior Associate Software Engineer",
        "years": "11.2020 - 07.2023",
        "mainTech": [
          "C++ 11"
        ],
        "technologies": [
          "C++",
          "JavaScript",
          "Dojo",
          "REST API",
          "Bootstrap",
          "HTML",
          "CSS",
          "MATLAB",
          "Simulink",
          "Perforce",
          "Gecko",
          "Jira"
        ],
        "description": [
        ]
      },
      {
        "company": "MathWorks",
        "title": "Software Engineering Intern",
        "years": "01.2020 - 06.2020",
        "mainTech": [
          "Python, MATLAB"
        ],
        "technologies": [
          "MATLAB",
          "Python",
          "JavaScript",
          "Git",
          "Docker",
          "HERE HD",
          "Open Street Maps",
          "openDRIVE"
        ],
        "description": [
        ]
      },
      {
        "company": "Sayint.ai",
        "title": "Software Engineering Intern",
        "years": "11.2018 - 03.2019",
        "mainTech": [
          "Python"
        ],
        "technologies": [
          "Python",
          "Celery",
          "Flask",
          "PostgreSQL",
          "RASA",
          "Mycroft"
        ],
        "description": [
        ]
      }
    ],
    "education": [
      {
        "university": "Clemson University, SC",
        "degree": "Master of Science, Computer Science",
        "specialization": "Networks, Systems, and Security",
        "dates": "Aug 2023 - May 2025",
        "gpa": "4.0/4.0",
        "description": "Graduate Research Assistant - VIPR-GS Lab, Autonomous Ground Vehicle Reliability (10+ Environmental Factors)"
      },
      {
        "university": "JNTUH College of Engineering, Hyderabad, India",
        "degree": "Bachelor of Technology, Computer Science",
        "dates": "Aug 2016 - Sep 2020",
        "gpa": "9.11/10",
        "description": "Technical Assistant, NASA Space Apps Hackathon finalist, Founder of Bits and Bytes: Guiding 200+ students in DS & Algo."
      }
    ],
    "credentials": [
      {
        "type": "Certification",
        "title": "AWS Certified Developer – Associate",
        "date": "June 2024",
        "issuer": "Amazon Web Services",
        "description": "Earned the AWS Developer – Associate certification, which validates proficiency in developing, deploying, and debugging cloud-based applications using AWS.",
        "url": "https://www.credly.com/badges/e678dbd2-86bd-4479-8137-5c58b338fd2a",
        "badgeUrl": "images/AWS.png"
      },
      {
        "type": "Publication",
        "title": "Speech Emotion Recognition Using Multimodal Biometrics",
        "date": "2024",
        "description": "This paper presents our findings on using Mel spectrograms and data augmentation techniques to enhance Speech Emotion Recognition systems, achieving an impressive model accuracy of 75%.",
        "url": "https://app.box.com/s/8600smczowa0f71fauroe6r4sztpel8r"
      }
    ]    
  }
  